{
	"name" : "Italian Macarons",
	"notes" : "You got this.",
	"meta" : {
		"serves": "4",
		"active": "30 minutes",
		"total": "1 3/4 hours"
	},
	"ingredients" : [
		{
			"name" : "Almond Flour",
			"href": "https://amzn.to/2KYV8uK",
			"amt" : {
				"whole" : "150",
				"measure" : {
					"abbr" : "G.",
					"full" : "Grams"
				}
			}
		},
		{
			"name" : "Confectioner’s Sugar",
			"href": "https://amzn.to/2N4517G",
			"amt" : {
				"whole" : "150",
				"measure" : {
					"abbr" : "G.",
					"full" : "Grams"
				}
			}
		},
		{
			"name" : "Egg Whites",
			"amt" : {
				"whole" : "110",
				"measure" : {
					"abbr" : "G.",
					"full" : "Grams"
				}
			}
		},
		{
			"name" : "Caster Sugar",
			"href": "https://amzn.to/2NI31Tx",
			"amt" : {
				"whole" : "150",
				"measure" : {
					"abbr" : "G.",
					"full" : "Grams"
				}
			}
		},
		{
			"name" : "Water",
			"amt" : {
				"whole" : "35",
				"measure" : {
					"abbr" : "G.",
					"full" : "Grams"
				}
			}
		},
		{
			"name" : "Vanilla Extract",
			"amt" : {
				"frac" : "1/2",
				"measure" : {
					"abbr" : "tsp.",
					"full" : "Teaspoon"
				}
			}
		}
	],
	"instructions": [
		"Pre-heat your oven to 320° f (160° c).",
		"Ideally, put the confectioner’s sugar and almond flour in a food processor and run it to combine. Worst case, sift them together. Separate 55 grams of egg whites in a large mixing bowl. Mix the egg whites into the almond flour and powdered sugar to form a thick, gritty paste.",
		"Heat the water and caster sugar in a small saucepan until it hits “soft-ball” (240° f, 115° c) on a candy thermometer. You should be able to eyeball it by it bubbling and turning mostly clear, but I’m not gonna make any promises there—a reliable instant-read thermometer is the only way to be sure.",
		"While the sugar syrup is coming up to heat, put the remaining egg whites into the bowl of a stand mixer and turn it to medium-high. Once soft peaks are forming, slowly pour the sugar syrup down the inside of the mixing bowl through a mesh strainer, then trickle in vanilla extract. Leave the mixer running for another five minutes.",
		"Take rougly a third of the meringue and mix it into the almond flour and confectioner’s sugar paste—no need to be careful with this step; you can add a few drops of food coloring gel at this point. Add the remaining meringue and thoroughly fold it into the mix with a rubber spatula. Once fully incorporated (be sure to scrape the bottom of the bowl), it should run off the spatula in thick ribbons, and settle back into the rest of the mixture in ten seconds or so—if it takes longer than that to incorporate, keep folding until it thins slightly.",
		"Pipe into silver dollar sized discs on dark cookie sheets lined with parchment paper, leaving at least an inch or two between each shell—you can draw circle guides on the underside of the parchment with a Sharpie. You should be able to hold the piping bag still, centered, using a small round piping tip. The peak in the center should incorporate after a few seconds, and sit flat again. They’ll spread slightly, but should be rounded on the sides, rather than completely flat.",
		"Give the cookie sheets a few sharp raps against the countertop to pop the bubbles on the tops of the shells; they might spread slightly, but not by much. If you’re feeling particularly fussy, you can carefully pop any remaining bubbles with a toothpick—getting rid of them will keep the domes from cracking in the oven.",
		"Leave them uncovered, at room temperature, for at least an hour. This causes the domes to dry out and harden slightly, giving you a smooth shell and “feet” at the bottom. By the time they go into the oven, they should feel dry to the touch.",
		"Bake at 320° f for fifteen minutes. Wait at least ten minutes before you rotate the cookie sheets, so they don’t collapse on you. Allow them to cool completely before removing."
	]
}